app/Models/Model_oficinas.php

    public function obtener_oficinas()
    {
        return $this->findAll();
---
SELECT *
FROM `oficinas`