app/Models/Model_incidencias.php

SELECT *
FROM `incidencias`
WHERE `id_incidencia` = '9'
 LIMIT 1
---
    public function obtener_incidencia($id_incidencia)
    {
        return $this->where("id_incidencia", $id_incidencia)->first();